let evaluation_ratio1=[
    {
        "name": "男生",
        "count":1402195
    },
    {
        "name":"女生",
        "count":1263300
    }
];
    
let evaluation_ratio2=[
    {
        "name": "男生",
        "count": 705975
    },
    {
        "name":"女生",
        "count":732219
    },
];
    
        let evaluation_ratio3=[
            {
                "name": "幼兒園",
                "count": 149517
            },
            {
                "name":"國小",
                "count":1178311
            },
            {
                "name":"國中",
                "count":479658
            },
            {
                "name":"高中",
                "count":363985
            },
            {
                "name":"大專",
                "count":456651
            },
            {
                "name":"博士班",
                "count":22443
            },
            {
                "name":"碩士班",
                "count":126746
            },
            {
                "name":"學士班",
                "count":295662
            },
            {
                "name":"專科",
                "count":11800
            },
            {
                "name":"宗教研修學院",
                "count":0
            },
            {
                "name":"特教學校",
                "count":4391
            },
            ];
    
            let evaluation_ratio4=[
                {
                    "name": "幼兒園",
                    "count": 423213
                },
                {
                    "name":"國小",
                    "count":44227
                },
                {
                    "name":"國中",
                    "count":82572
                },
                {
                    "name":"高中",
                    "count":203958
                },
                {
                    "name":"大專",
                    "count":683438
                },
                {
                    "name":"博士班",
                    "count":6229
                },
                {
                    "name":"碩士班",
                    "count":48180
                },
                {
                    "name":"學士班",
                    "count":560805
                },
                {
                    "name":"專科",
                    "count":68224
                },
                {
                    "name":"宗教研修學院",
                    "count":559
                },
                {
                    "name":"特教學校",
                    "count":63
                },
                ];
                let set1=[
                    [103,2985206], 
                    [104,2884826], 
                    [105,2785759], 
                    [106,2729820], 
                    [107,2704509], 
                    [108,2688043], 
                    [109,2669813],
                    [110,2669520],
                    [111,2665495],   
                ]
                    let set2=[
                        [103,1744259], 
                        [104,1731252], 
                        [105,1718604], 
                        [106,1673870], 
                        [107,1620518], 
                        [108,1572294], 
                        [109,1541918],
                        [110,1502110],
                        [111,1438194],   
                    ]
                    let set3=[
                        [103,4729765], 
                        [104,4616078], 
                        [105,4504363], 
                        [106,4403690], 
                        [107,4325027], 
                        [108,4260337], 
                        [109,4211731],
                        [110,4171630],
                        [111,4103689],   
                    ]